### OpenTofu Plan

This PR includes infrastructure changes. Please review the plan before merging.

<details>
<summary>Plan Summary</summary>

```

  # aws_ses_domain_identity.sender must be replaced
-/+ resource "aws_ses_domain_identity" "sender" {
      ~ arn                = "arn:aws:ses:us-west-2:087108798373:identity/samshadwell.com" -> (known after apply)
      ~ domain             = "samshadwell.com" -> "hndigest.samshadwell.com" # forces replacement
      ~ id                 = "samshadwell.com" -> (known after apply)
      ~ verification_token = "45m/8LYvSIzGMWH5Z4mo6eOyLOGBvNe0tdmkBjRJBSU=" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "tfplan"

```

</details>

> Run `tofu plan` locally for the full output.